<template>
	<div class='test'>
		<test-intro v-if="!start && !end"/>
		<test-questions
			v-if="start && !end"
			:company='company'
			:questions='questions'
			:active='activeItem'
			:time='time'/>
		<test-finish
			v-if='!start && end'
			:data='answers'/>
	</div>
</template>

<script>
	import intro from '@/components/test/intro.vue'
	import questions from '@/components/test/questions.vue'
	import finish from '@/components/test/finish.vue'
	export default {
		components: {
			'test-intro': intro,
			'test-questions': questions,
			'test-finish': finish,
		},
		data() {
			return {
				company: {
					name: 'McDonald’s'
				},
				start: false,
				end: false,
				time: 2400,
				activeItem: 0,
				questions: [
					{
						question: 'Как правильно раскладывать приборы?',
						answers: [
							{
								text: 'Приборы для первого блюда кладут дальше всего от тарелки гостя, приборы для последующих блюд кладут один за другим ближе к тарелке'
							},
							{
								text: 'Приборы для первого блюда кладут ближе всего к тарелке гостя, приборы для последующих блюд кладут один за другим дальше от тарелки'
							},
							{
								text: 'Приборы кладут один за другим ближе к тарелке, в том порядке, в котором будут подаваться блюда'
							},
						]
					},
					{
						question: 'Видео вопрос (что входит в обязанности официанта)?',
						text: 'Посмотрите видео',
						video: 'https://www.youtube.com/watch?v=X8zLJlU_-60',
						answers: [
							{
								text: 'Сервировка стола'
							},
							{
								text: 'Выводит окончательную сумму заказа'
							},
							{
								text: 'Контролирует своевременность приготовления и товарный вид блюд перед подачей на стол'
							},
						]
					},
					{
						question: 'Как не следует поступать,  если гость недоволен процедурой подачи пищи, сравнивая ее с сервисом в других ресторанах?',
						text: 'Посмотрите видео',
						image: 'https://placeimg.com/640/480/any',
						answers: [
							{
								text: 'Рассказать особенности технологии приготовления и подачи блюд в ресторане'
							},
							{
								text: 'Спорить с посетителем, доказывая свою компетентность'
							},
							{
								text: 'Пригласить в зал ресторана метрдотеля или шеф-повара'
							},
						]
					},
					{
						question: 'Как правильно раскладывать приборы?',
						answers: [
							{
								text: 'Приборы для первого блюда кладут дальше всего от тарелки гостя, приборы для последующих блюд кладут один за другим ближе к тарелке'
							},
							{
								text: 'Приборы для первого блюда кладут ближе всего к тарелке гостя, приборы для последующих блюд кладут один за другим дальше от тарелки'
							},
							{
								text: 'Приборы кладут один за другим ближе к тарелке, в том порядке, в котором будут подаваться блюда'
							},
						]
					},
					{
						question: 'Видео вопрос (что входит в обязанности официанта)?',
						text: 'Посмотрите видео',
						video: 'https://www.youtube.com/watch?v=X8zLJlU_-60',
						answers: [
							{
								text: 'Сервировка стола'
							},
							{
								text: 'Выводит окончательную сумму заказа'
							},
							{
								text: 'Контролирует своевременность приготовления и товарный вид блюд перед подачей на стол'
							},
						]
					},
					{
						question: 'Как не следует поступать,  если гость недоволен процедурой подачи пищи, сравнивая ее с сервисом в других ресторанах?',
						text: 'Посмотрите видео',
						image: 'https://placeimg.com/640/480/any',
						answers: [
							{
								text: 'Рассказать особенности технологии приготовления и подачи блюд в ресторане'
							},
							{
								text: 'Спорить с посетителем, доказывая свою компетентность'
							},
							{
								text: 'Пригласить в зал ресторана метрдотеля или шеф-повара'
							},
						]
					},
					{
						question: 'Как правильно раскладывать приборы?',
						answers: [
							{
								text: 'Приборы для первого блюда кладут дальше всего от тарелки гостя, приборы для последующих блюд кладут один за другим ближе к тарелке'
							},
							{
								text: 'Приборы для первого блюда кладут ближе всего к тарелке гостя, приборы для последующих блюд кладут один за другим дальше от тарелки'
							},
							{
								text: 'Приборы кладут один за другим ближе к тарелке, в том порядке, в котором будут подаваться блюда'
							},
						]
					},
					{
						question: 'Видео вопрос (что входит в обязанности официанта)?',
						text: 'Посмотрите видео',
						video: 'https://www.youtube.com/watch?v=X8zLJlU_-60',
						answers: [
							{
								text: 'Сервировка стола'
							},
							{
								text: 'Выводит окончательную сумму заказа'
							},
							{
								text: 'Контролирует своевременность приготовления и товарный вид блюд перед подачей на стол'
							},
						]
					},
					{
						question: 'Как не следует поступать,  если гость недоволен процедурой подачи пищи, сравнивая ее с сервисом в других ресторанах?',
						text: 'Посмотрите видео',
						image: 'https://placeimg.com/640/480/any',
						answers: [
							{
								text: 'Рассказать особенности технологии приготовления и подачи блюд в ресторане'
							},
							{
								text: 'Спорить с посетителем, доказывая свою компетентность'
							},
							{
								text: 'Пригласить в зал ресторана метрдотеля или шеф-повара'
							},
						]
					},
					{
						question: 'Как не следует поступать,  если гость недоволен процедурой подачи пищи, сравнивая ее с сервисом в других ресторанах?',
						text: 'Посмотрите видео',
						image: 'https://placeimg.com/640/480/any',
						answers: [
							{
								text: 'Рассказать особенности технологии приготовления и подачи блюд в ресторане'
							},
							{
								text: 'Спорить с посетителем, доказывая свою компетентность'
							},
							{
								text: 'Пригласить в зал ресторана метрдотеля или шеф-повара'
							},
						]
					}
				],
				answers: []
			}
		},
		methods: {
			startTimer() {
				setInterval(() => {
					// if (this.time !== 0) {}
					this.time -= 1;
				}, 1000);
			}
		},
	}
</script>

<style lang="scss" scoped>
.test {
	min-height: 100vh;
	background: #2B2B2B;
}
</style>
